Reports/КнигаНалоговогоУчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Report>
		<Properties>
			<Name>КнигаНалоговогоУчета</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачалоПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонецПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РежимРасшифровки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СписокСформированныхЛистов</Name>
					<Type>
						<v8:Type>v8:ValueListType</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПечататьТитульныйЛист</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыводитьИтогиСНарастающимИтогом</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачалоДеятельности</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонецДеятельности</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

AccumulationRegisters/НДС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<AccumulationRegister>
		<Properties>
			<Name>НДС</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СуммаБезНДС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОборотПоРеализации</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаНДС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Налогоплательщик</Name>
					<Comment>Организация - плательщик НДС</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидОперацииРеализации</Name>
					<Comment>Вид операции реализации для Декларации по НДС</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыРеализации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидНалогаНДС</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыНДС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтавкаНДС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтавкиНДС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТМЗ</Name>
					<Comment>Наименование реализованных товаров (работ, услуг)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.НематериальныеАктивы</v8:Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
						<v8:Type>cfg:CatalogRef.ОсновныеСредства</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ГТД</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НомераГТД</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтруктурнаяЕдиница</Name>
					<Comment>Структурное подразделение организации</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccumulationRegisters/КорректировкаНДС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<AccumulationRegister>
		<Properties>
			<Name>КорректировкаНДС</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СуммаКорректировкиОборота</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаНДС</Name>
					<Comment>Сумма НДС, относимая в зачет</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Налогоплательщик</Name>
					<Comment>Организация - плательщик НДС</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Comment>Организация, к которой принадлежит документ-регистратор</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидОперацииКорректировки</Name>
					<Comment>Вид операции корректировки приобретения/реализации для Декларации по НДС</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыРеализации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидНалогаНДС</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыНДС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Comment>Поставщик</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТМЗ</Name>
					<Comment>Наименование реализованных товаров (работ, услуг)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.НематериальныеАктивы</v8:Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
						<v8:Type>cfg:CatalogRef.ОсновныеСредства</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтавкаНДС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтавкиНДС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтруктурнаяЕдиница</Name>
					<Comment>Структурное подразделение организации</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccumulationRegisters/НДСКВозмещению.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<AccumulationRegister>
		<Properties>
			<Name>НДСКВозмещению</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>УплаченныйНДС</Name>
					<Comment>Сумма НДС, уплаченная поставщику при приобретении ТМЗ, работ, услуг</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаБезНДС</Name>
					<Comment>Стоимость приобретенных товаров (работ, услуг) без включения в нее НДС</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаНДС</Name>
					<Comment>Сумма НДС, относимая в зачет</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ВидВходящегоДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВходящегоДокумента</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерВходящегоДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Налогоплательщик</Name>
					<Comment>Организация - плательщик НДС</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидОборота</Name>
					<Comment>Вид оборота - облагаемый, освобожденный, общий</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОборотовПоРеализации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидОперацииПоступления</Name>
					<Comment>Вид операции приобретения для Декларации по НДС</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыПоступления</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидНалогаНДС</Name>
					<Comment>Вид налога НДС - НДС, НДС методом зачета и т.д.</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыНДС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтавкаНДС</Name>
					<Comment>Ставка НДС</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СтавкиНДС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Comment>Поставщик</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТМЗ</Name>
					<Comment>Наименование приобретенного товара, работы, услуги</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.НематериальныеАктивы</v8:Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
						<v8:Type>cfg:CatalogRef.ОсновныеСредства</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтруктурнаяЕдиница</Name>
					<Comment>Структурное подразделение организации</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СчетФактура</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.СчетФактураПолученный</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Enums/ВидыНДС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Enum>
		<Properties>
			<Name>ВидыНДС</Name>
			<Comment>Виды налога на добавленную стоимость</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НДС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДСМетодомЗачета</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДССИзменениемСрокаУплаты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДСЗаНерезидента</Name>
					<Comment>НДС, подлежащий уплате за нерезидента</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДСОблагаемыйИмпорт</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Reports/КнигаНалоговогоУчета/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

////////////////////////////////////////////////////////////////////////////////
// ПРОГРАММНЫЙ ИНТЕРФЕЙС

Процедура СформироватьОтчет(Знач ПараметрыОтчета, АдресХранилища) Экспорт
	
	ПараметрыОтчета.СписокСформированныхЛистов.Очистить();
	
	СписокСформированныхЛистов = Новый СписокЗначений; 
	
	СформироватьКнигуНУ(ПараметрыОтчета, СписокСформированныхЛистов);
	   
	ПоместитьВоВременноеХранилище(СписокСформированныхЛистов, АдресХранилища);
	
КонецПроцедуры

Процедура СформироватьКнигуНУ(ПараметрыОтчета, СписокСформированныхЛистов)
	
	ДокументРезультат = Новый ТабличныйДокумент;
	ДокументТитульный = Новый ТабличныйДокумент;
	
	Макет = ПолучитьМакет("ВедомостьУчетаДоходов");
	
	ОбластьШапкаОтчет = Макет.ПолучитьОбласть("Шапка|Отчет");
	ОбластьЗаголовокОтчет = Макет.ПолучитьОбласть("Заголовок|Отчет");
	ОбластьДетальнаяЗапись = Макет.ПолучитьОбласть("ДетальнаяСтрока|Отчет");
	ОбластьНДСДетальнаяЗапись = Макет.ПолучитьОбласть("ДетальнаяСтрока|НДС");
	ОбластьНДСКВозмещениюДетЗапись = Макет.ПолучитьОбласть("ДетальнаяСтрока|НДСКВозмещению");

	ОбластьОстатокНаКонецДня = Макет.ПолучитьОбласть("ОстатокНаКД|Отчет");
	ОбластьОстатокНаКонецМесяца = Макет.ПолучитьОбласть("ОстатокНаКМ|Отчет");
	ОбластьОстатокНаКонецКвартала= Макет.ПолучитьОбласть("ОстатокНаКК|Отчет");
	ОбластьОстатокНаКонецПолугодия = Макет.ПолучитьОбласть("ОстатокНаКП|Отчет");
	ОбластьОстатокНаКонецГода = Макет.ПолучитьОбласть("ОстатокНаКГ|Отчет");
	
	ОбластьПодвалОтчет = Макет.ПолучитьОбласть("Подвал|Отчет");
	
	ЗаполнятьМесяц = Ложь;
	ЗаполнятьКвартал = Ложь;
	ЗаполнятьПолугодие = Ложь;
	ЗаполнятьГод = Ложь;
	ЗаполнятьДень = Истина;
			
	Организация = ПараметрыОтчета.Организация;
		
	ВалютаРегламентированногоУчета = ОбщегоНазначенияБКВызовСервераПовтИсп.ПолучитьВалютуРегламентированногоУчета();
	
	Если НачалоДня(ПараметрыОтчета.НачалоПериода) <> НачалоДня(ПараметрыОтчета.КонецПериода)  Тогда
		ОбластьЗаголовокОтчет.Параметры.ПериодОтчета = "" + Формат(ПараметрыОтчета.НачалоПериода, "ДФ=dd.MM.yyyy") + " - " + Формат(ПараметрыОтчета.КонецПериода, "ДФ=dd.MM.yyyy");
	Иначе
		ОбластьЗаголовокОтчет.Параметры.ПериодОтчета = "" + Формат(ПараметрыОтчета.КонецПериода, "ДФ=dd.MM.yyyy");
	КонецЕсли;
	
	ВывестиДанныеВОтчет(ДокументРезультат, ОбластьЗаголовокОтчет, ПараметрыОтчета);
	
	ВывестиДанныеВОтчет(ДокументРезультат, ОбластьШапкаОтчет, ПараметрыОтчета);

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВЫРАЗИТЬ(СУММА(НДСОбороты.ОборотПоРеализацииОборот) КАК ЧИСЛО(15, 2)) КАК ОборотПоРеализацииОборот,
		|	ВЫРАЗИТЬ(СУММА(НДСОбороты.СуммаНДСОборот) КАК ЧИСЛО(15, 2)) КАК СуммаНДСОборот,
		|	НДСОбороты.Период КАК Период,
		|	ВЫРАЗИТЬ(СУММА(НДСОбороты.ОборотПоРеализацииОборот + НДСОбороты.СуммаНДСОборот) КАК ЧИСЛО(15, 2)) КАК ОбщаяСумма
		|ПОМЕСТИТЬ ВТ_НДС_До
		|ИЗ
		|	РегистрНакопления.НДС.Обороты(
		|			&НачалоПериодаДо,
		|			&КонецПериодаДо,
		|			Месяц,
		|			Организация = &Организация
		|				И &НачалоПериодаДо <> &НачалоПериода) КАК НДСОбороты
		|ГДЕ
		|	НДСОбороты.ВидНалогаНДС = ЗНАЧЕНИЕ(Перечисление.ВидыНДС.НДС)
		|
		|СГРУППИРОВАТЬ ПО
		|	НДСОбороты.Период
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВЫРАЗИТЬ(СУММА(КорректировкаНДСОбороты.СуммаКорректировкиОборотаОборот) КАК ЧИСЛО(15, 2)),
		|	ВЫРАЗИТЬ(СУММА(КорректировкаНДСОбороты.СуммаНДСОборот) КАК ЧИСЛО(15, 2)),
		|	КорректировкаНДСОбороты.Период,
		|	ВЫРАЗИТЬ(СУММА(КорректировкаНДСОбороты.СуммаКорректировкиОборотаОборот + КорректировкаНДСОбороты.СуммаНДСОборот) КАК ЧИСЛО(15, 2))
		|ИЗ
		|	РегистрНакопления.КорректировкаНДС.Обороты(
		|			&НачалоПериодаДо,
		|			&КонецПериодаДо,
		|			Месяц,
		|			Организация = &Организация
		|				И &НачалоПериодаДо <> &НачалоПериода) КАК КорректировкаНДСОбороты
		|ГДЕ
		|	КорректировкаНДСОбороты.ВидНалогаНДС = ЗНАЧЕНИЕ(Перечисление.ВидыНДС.НДС)
		|
		|СГРУППИРОВАТЬ ПО
		|	КорректировкаНДСОбороты.Период
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВЫРАЗИТЬ(СУММА(НДСКВозмещениюОбороты.СуммаНДСОборот) КАК ЧИСЛО(15, 2)) КАК СуммаНДСОборот,
		|	ВЫРАЗИТЬ(СУММА(НДСКВозмещениюОбороты.СуммаБезНДСОборот) КАК ЧИСЛО(15, 2)) КАК СуммаБезНДСОборот,
		|	НДСКВозмещениюОбороты.Период КАК Период
		|ПОМЕСТИТЬ ВТ_НДСКВозмещению_До
		|ИЗ
		|	РегистрНакопления.НДСКВозмещению.Обороты(
		|			&НачалоПериодаДо,
		|			&КонецПериодаДо,
		|			Месяц,
		|			Организация = &Организация
		|				И &НачалоПериодаДо <> &НачалоПериода) КАК НДСКВозмещениюОбороты
		|
		|СГРУППИРОВАТЬ ПО
		|	НДСКВозмещениюОбороты.Период
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВЫРАЗИТЬ(СУММА(КорректировкаНДСКВозмещениюОбороты.СуммаНДСОборот) КАК ЧИСЛО(15, 2)),
		|	ВЫРАЗИТЬ(СУММА(КорректировкаНДСКВозмещениюОбороты.СуммаКорректировкиОборотаОборот) КАК ЧИСЛО(15, 2)),
		|	КорректировкаНДСКВозмещениюОбороты.Период
		|ИЗ
		|	РегистрНакопления.КорректировкаНДСКВозмещению.Обороты(
		|			&НачалоПериодаДо,
		|			&КонецПериодаДо,
		|			Месяц,
		|			Организация = &Организация
		|				И &НачалоПериодаДо <> &НачалоПериода) КАК КорректировкаНДСКВозмещениюОбороты
		|
		|СГРУППИРОВАТЬ ПО
		|	КорректировкаНДСКВозмещениюОбороты.Период
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СУММА(ВТ_НДС_До.ОборотПоРеализацииОборот) КАК ОборотСуммаНДСИтог,
		|	СУММА(ВТ_НДС_До.СуммаНДСОборот) КАК СуммаНДСИтог,
		|	ВТ_НДС_До.Период КАК Период,
		|	0 КАК СуммаБезНДСИтог,
		|	СУММА(ВТ_НДС_До.ОбщаяСумма) КАК ОбщаяСуммаИтог,
		|	0 КАК СуммаНДСКВозмещениюИтог
		|ПОМЕСТИТЬ ВТ_Итоги
		|ИЗ
		|	ВТ_НДС_До КАК ВТ_НДС_До
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_НДС_До.Период
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	0,
		|	0,
		|	ВТ_НДСКВозмещению_До.Период,
		|	СУММА(ВТ_НДСКВозмещению_До.СуммаБезНДСОборот),
		|	0,
		|	СУММА(ВТ_НДСКВозмещению_До.СуммаНДСОборот)
		|ИЗ
		|	ВТ_НДСКВозмещению_До КАК ВТ_НДСКВозмещению_До
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_НДСКВозмещению_До.Период
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СУММА(ВТ_Группировка.ОборотСуммаНДСИтог) КАК ОборотСуммаНДСИтог,
		|	СУММА(ВТ_Группировка.СуммаНДСИтог) КАК СуммаНДСИтог,
		|	НАЧАЛОПЕРИОДА(ВТ_Группировка.Период, МЕСЯЦ) КАК Период,
		|	СУММА(ВТ_Группировка.СуммаБезНДСИтог) КАК СуммаБезНДСИтог,
		|	СУММА(ВТ_Группировка.ОбщаяСуммаИтог) КАК ОбщаяСуммаИтог,
		|	СУММА(ВТ_Группировка.СуммаНДСКВозмещениюИтог) КАК СуммаНДСКВозмещениюИтог
		|ПОМЕСТИТЬ ВременнаяТаблицаМесяц
		|ИЗ
		|	ВТ_Итоги КАК ВТ_Группировка
		|
		|СГРУППИРОВАТЬ ПО
		|	НАЧАЛОПЕРИОДА(ВТ_Группировка.Период, МЕСЯЦ)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	НДСОбороты.Регистратор КАК Регистратор,
		|	НДСОбороты.ОборотПоРеализацииОборот КАК ОборотПоРеализацииОборот,
		|	НДСОбороты.СуммаНДСОборот КАК СуммаНДСОборот
		|ПОМЕСТИТЬ ВТ_НДС
		|ИЗ
		|	РегистрНакопления.НДС.Обороты(&НачалоПериода, КОНЕЦПЕРИОДА(&КонецПериода, ДЕНЬ), Регистратор, Организация = &Организация) КАК НДСОбороты
		|ГДЕ
		|	НДСОбороты.ВидНалогаНДС = ЗНАЧЕНИЕ(Перечисление.ВидыНДС.НДС)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	КорректировкаНДСОбороты.Регистратор,
		|	КорректировкаНДСОбороты.СуммаКорректировкиОборотаОборот,
		|	КорректировкаНДСОбороты.СуммаНДСОборот
		|ИЗ
		|	РегистрНакопления.КорректировкаНДС.Обороты(&НачалоПериода, КОНЕЦПЕРИОДА(&КонецПериода, ДЕНЬ), Регистратор, Организация = &Организация) КАК КорректировкаНДСОбороты
		|ГДЕ
		|	КорректировкаНДСОбороты.ВидНалогаНДС = ЗНАЧЕНИЕ(Перечисление.ВидыНДС.НДС)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	НДСКВозмещениюОбороты.Регистратор КАК Регистратор,
		|	НДСКВозмещениюОбороты.СуммаНДСОборот КАК СуммаНДСОборот,
		|	НДСКВозмещениюОбороты.СуммаБезНДСОборот КАК СуммаБезНДСОборот
		|ПОМЕСТИТЬ ВТ_НДСКВозмещению
		|ИЗ
		|	РегистрНакопления.НДСКВозмещению.Обороты(&НачалоПериода, КОНЕЦПЕРИОДА(&КонецПериода, ДЕНЬ), Регистратор, Организация = &Организация) КАК НДСКВозмещениюОбороты
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	КорректировкаНДСКВозмещениюОбороты.Регистратор,
		|	КорректировкаНДСКВозмещениюОбороты.СуммаНДСОборот,
		|	КорректировкаНДСКВозмещениюОбороты.СуммаКорректировкиОборотаОборот
		|ИЗ
		|	РегистрНакопления.КорректировкаНДСКВозмещению.Обороты(&НачалоПериода, КОНЕЦПЕРИОДА(&КонецПериода, ДЕНЬ), Регистратор, Организация = &Организация) КАК КорректировкаНДСКВозмещениюОбороты
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_НДС.Регистратор КАК РегистраторНДС,
		|	ВЫРАЗИТЬ(СУММА(ВТ_НДС.ОборотПоРеализацииОборот) КАК ЧИСЛО(15, 2)) КАК ОборотСуммаНДС,
		|	ВЫРАЗИТЬ(СУММА(ВТ_НДС.СуммаНДСОборот) КАК ЧИСЛО(15, 2)) КАК СуммаНДС,
		|	0 КАК СуммаБезНДС,
		|	NULL КАК РегистраторНДСКВозмещению,
		|	0 КАК СуммаНДСКВозмещению,
		|	ВЫРАЗИТЬ(СУММА(ВТ_НДС.ОборотПоРеализацииОборот + ВТ_НДС.СуммаНДСОборот) КАК ЧИСЛО(15, 2)) КАК ОбщаяСумма,
		|	ВТ_НДС.Регистратор.Дата КАК РегистраторДата,
		|	КОНЕЦПЕРИОДА(ВТ_НДС.Регистратор.Дата, ДЕНЬ) КАК ДатаДень,
		|	КОНЕЦПЕРИОДА(ВТ_НДС.Регистратор.Дата, МЕСЯЦ) КАК ДатаМесяц,
		|	КОНЕЦПЕРИОДА(ВТ_НДС.Регистратор.Дата, КВАРТАЛ) КАК ДатаКвартал,
		|	КОНЕЦПЕРИОДА(ВТ_НДС.Регистратор.Дата, ПОЛУГОДИЕ) КАК ДатаПолугодие,
		|	КОНЕЦПЕРИОДА(ВТ_НДС.Регистратор.Дата, ГОД) КАК ДатаГод,
		|	ВТ_НДС.Регистратор.МоментВремени КАК РегистраторМоментВремени
		|ПОМЕСТИТЬ ВТ_Документы
		|ИЗ
		|	ВТ_НДС КАК ВТ_НДС
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_НДС.Регистратор,
		|	КОНЕЦПЕРИОДА(ВТ_НДС.Регистратор.Дата, ДЕНЬ),
		|	КОНЕЦПЕРИОДА(ВТ_НДС.Регистратор.Дата, МЕСЯЦ),
		|	КОНЕЦПЕРИОДА(ВТ_НДС.Регистратор.Дата, КВАРТАЛ),
		|	КОНЕЦПЕРИОДА(ВТ_НДС.Регистратор.Дата, ПОЛУГОДИЕ),
		|	КОНЕЦПЕРИОДА(ВТ_НДС.Регистратор.Дата, ГОД),
		|	ВТ_НДС.Регистратор.Дата,
		|	ВТ_НДС.Регистратор.МоментВремени
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	NULL,
		|	0,
		|	0,
		|	ВЫРАЗИТЬ(СУММА(ВТ_НДСКВозмещению.СуммаБезНДСОборот) КАК ЧИСЛО(15, 2)),
		|	ВТ_НДСКВозмещению.Регистратор,
		|	ВЫРАЗИТЬ(СУММА(ВТ_НДСКВозмещению.СуммаНДСОборот) КАК ЧИСЛО(15, 2)),
		|	0,
		|	ВТ_НДСКВозмещению.Регистратор.Дата,
		|	КОНЕЦПЕРИОДА(ВТ_НДСКВозмещению.Регистратор.Дата, ДЕНЬ),
		|	КОНЕЦПЕРИОДА(ВТ_НДСКВозмещению.Регистратор.Дата, МЕСЯЦ),
		|	КОНЕЦПЕРИОДА(ВТ_НДСКВозмещению.Регистратор.Дата, КВАРТАЛ),
		|	КОНЕЦПЕРИОДА(ВТ_НДСКВозмещению.Регистратор.Дата, ПОЛУГОДИЕ),
		|	КОНЕЦПЕРИОДА(ВТ_НДСКВозмещению.Регистратор.Дата, ГОД),
		|	ВТ_НДСКВозмещению.Регистратор.МоментВремени
		|ИЗ
		|	ВТ_НДСКВозмещению КАК ВТ_НДСКВозмещению
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_НДСКВозмещению.Регистратор,
		|	КОНЕЦПЕРИОДА(ВТ_НДСКВозмещению.Регистратор.Дата, ДЕНЬ),
		|	КОНЕЦПЕРИОДА(ВТ_НДСКВозмещению.Регистратор.Дата, МЕСЯЦ),
		|	КОНЕЦПЕРИОДА(ВТ_НДСКВозмещению.Регистратор.Дата, КВАРТАЛ),
		|	КОНЕЦПЕРИОДА(ВТ_НДСКВозмещению.Регистратор.Дата, ПОЛУГОДИЕ),
		|	КОНЕЦПЕРИОДА(ВТ_НДСКВозмещению.Регистратор.Дата, ГОД),
		|	ВТ_НДСКВозмещению.Регистратор.Дата,
		|	ВТ_НДСКВозмещению.Регистратор.МоментВремени
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ВТ_Документы.РегистраторНДС) КАК РегистраторНДСПредставление,
		|	ЕСТЬNULL(ВТ_Документы.ОбщаяСумма, 0) КАК ОбщаяСумма,
		|	ЕСТЬNULL(ВТ_Документы.СуммаНДС, 0) КАК СуммаНДС,
		|	ЕСТЬNULL(ВТ_Документы.ОборотСуммаНДС, 0) КАК ОборотСуммаНДС,
		|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ВТ_Документы.РегистраторНДСКВозмещению) КАК РегистраторНДСКВозмещениюПредставление,
		|	ЕСТЬNULL(ВТ_Документы.СуммаНДСКВозмещению, 0) КАК СуммаНДСКВозмещению,
		|	ЕСТЬNULL(ВТ_Документы.СуммаБезНДС, 0) КАК СуммаБезНДС,
		|	ЕСТЬNULL(ВТ_Документы.РегистраторДата, ВременнаяТаблицаМесяц.Период) КАК РегистраторДата,
		|	ВТ_Документы.ДатаДень КАК ДатаДень,
		|	ЕСТЬNULL(ВТ_Документы.ДатаМесяц, ВременнаяТаблицаМесяц.Период) КАК ДатаМесяц,
		|	ЕСТЬNULL(ВТ_Документы.ДатаКвартал, КОНЕЦПЕРИОДА(ВременнаяТаблицаМесяц.Период, КВАРТАЛ)) КАК ДатаКвартал,
		|	ЕСТЬNULL(ВТ_Документы.ДатаПолугодие, КОНЕЦПЕРИОДА(ВременнаяТаблицаМесяц.Период, ПОЛУГОДИЕ)) КАК ДатаПолугодие,
		|	ЕСТЬNULL(ВТ_Документы.ДатаГод, КОНЕЦПЕРИОДА(ВременнаяТаблицаМесяц.Период, ГОД)) КАК ДатаГод,
		|	ВТ_Документы.РегистраторНДС КАК РегистраторНДС,
		|	ВТ_Документы.РегистраторНДСКВозмещению КАК РегистраторНДСКВозмещению,
		|	ЕСТЬNULL(ВременнаяТаблицаМесяц.ОбщаяСуммаИтог, 0) КАК ОбщаяСуммаИтогМесяц,
		|	ЕСТЬNULL(ВременнаяТаблицаМесяц.ОборотСуммаНДСИтог, 0) КАК ОборотСуммаНДСИтогМесяц,
		|	ЕСТЬNULL(ВременнаяТаблицаМесяц.СуммаНДСИтог, 0) КАК СуммаНДСИтогМесяц,
		|	ЕСТЬNULL(ВременнаяТаблицаМесяц.СуммаБезНДСИтог, 0) КАК СуммаБезНДСИтогМесяц,
		|	ЕСТЬNULL(ВременнаяТаблицаМесяц.СуммаНДСКВозмещениюИтог, 0) КАК СуммаНДСКВозмещениюИтогМесяц
		|ИЗ
		|	ВТ_Документы КАК ВТ_Документы
		|		ПОЛНОЕ СОЕДИНЕНИЕ ВременнаяТаблицаМесяц КАК ВременнаяТаблицаМесяц
		|		ПО (НАЧАЛОПЕРИОДА(ВТ_Документы.ДатаМесяц, МЕСЯЦ) = НАЧАЛОПЕРИОДА(ВременнаяТаблицаМесяц.Период, МЕСЯЦ))
		|
		|УПОРЯДОЧИТЬ ПО
		|	ВТ_Документы.РегистраторМоментВремени,
		|	ДатаМесяц
		|ИТОГИ
		|	СУММА(ОбщаяСумма),
		|	СУММА(СуммаНДС),
		|	СУММА(ОборотСуммаНДС),
		|	СУММА(СуммаНДСКВозмещению),
		|	СУММА(СуммаБезНДС)
		|ПО
		|	ДатаГод,
		|	ДатаПолугодие,
		|	ДатаКвартал,
		|	ДатаМесяц,
		|	ДатаДень";
	
	Запрос.УстановитьПараметр("ВалютаРегламентированногоУчета", ВалютаРегламентированногоУчета);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("НачалоПериода", ПараметрыОтчета.НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода", КонецДня(ПараметрыОтчета.КонецПериода));
	
	Запрос.УстановитьПараметр("НачалоПериодаДо", НачалоГода(ПараметрыОтчета.НачалоПериода));
	Запрос.УстановитьПараметр("КонецПериодаДо", КонецДня(НачалоДня(ПараметрыОтчета.НачалоПериода)-1)); 

	Запрос.УстановитьПараметр("ПериодМакс", НачалоМесяца(ПараметрыОтчета.НачалоПериода));
	Запрос.УстановитьПараметр("ВыводитьМесяц", Истина);
	Запрос.УстановитьПараметр("ВыводитьКвартал", Истина);
	Запрос.УстановитьПараметр("ВыводитьПолугодие", Истина);
	Запрос.УстановитьПараметр("ВыводитьГод", Истина);	
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДатаГод = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "ДатаГод");

	Пока ВыборкаДатаГод.Следующий() Цикл
		
		ИтогоГодОбщаяСумма        	= 0;
		ИтогоГодОборотСуммаНДС 	    = 0;
		ИтогоГодСуммаНДС            = 0;
		ИтогоГодСуммаБезНДС		    = 0;
		ИтогоГодСуммаНДСКВозмещению = 0;
		
		Если ЗначениеЗаполнено(ВыборкаДатаГод.ДатаГод) Тогда
			ОбластьОстатокНаКонецКвартала.Параметры.КварталПериода = Формат(КонецГода(ВыборкаДатаГод.ДатаГод),"ДФ=" "г");
		КонецЕсли;
			
		ВыборкаДатаПолугодие = ВыборкаДатаГод.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "ДатаПолугодие");
	
		Пока ВыборкаДатаПолугодие.Следующий() Цикл
			
			Если ЗначениеЗаполнено(ВыборкаДатаПолугодие.ДатаПолугодие) Тогда
				Если ПолучитьНомерКвартала(ВыборкаДатаПолугодие.ДатаПолугодие) = 1 ИЛИ ПолучитьНомерКвартала(ВыборкаДатаПолугодие.ДатаПолугодие) = 2 Тогда
					ОбластьОстатокНаКонецПолугодия.Параметры.ПолугодиеПериода = 1;
				Иначе
					ОбластьОстатокНаКонецПолугодия.Параметры.ПолугодиеПериода = 2;
				КонецЕсли;
			КонецЕсли;
			
			ИтогоПолугодиеОбщаяСумма        	  = 0;
			ИтогоПолугодиеОборотСуммаНДС   		  = 0;
			ИтогоПолугодиеСуммаНДС          	  = 0;
			ИтогоПолугодиеСуммаБезНДС		      = 0;
			ИтогоПолугодиеСуммаНДСКВозмещению     = 0;
	
			ВыборкаДатаКвартал = ВыборкаДатаПолугодие.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "ДатаКвартал");
			
			Пока ВыборкаДатаКвартал.Следующий() Цикл
				
				Если ЗначениеЗаполнено(ВыборкаДатаКвартал.ДатаКвартал) Тогда
					ОбластьОстатокНаКонецКвартала.Параметры.КварталПериода = Формат(КонецКвартала(ВыборкаДатаКвартал.ДатаКвартал),"ДФ=" "к");
				КонецЕсли;   
				
				ИтогоКварталОбщаяСумма 	        = 0;
				ИтогоКварталОборотСуммаНДС      = 0;
				ИтогоКварталСуммаНДС 	        = 0;
				ИтогоКварталСуммаБезНДС         = 0;
				ИтогоКварталСуммаНДСКВозмещению = 0;
							
				ВыборкаДатаМесяц = ВыборкаДатаКвартал.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "ДатаМесяц");
				
					Пока ВыборкаДатаМесяц.Следующий() Цикл 					
						ИтогоМесяцОбщаяСумма                = 0;
						ИтогоМесяцОборотСуммаНДС            = 0;
						ИтогоМесяцСуммаНДС                  = 0;
						ИтогоМесяцОборотСуммаБезНДС			= 0;
						ИтогоМесяцОборотСуммаНДСКВозмещению = 0;
						
						Если ЗначениеЗаполнено(ВыборкаДатаМесяц.ДатаМесяц) Тогда
							ОбластьОстатокНаКонецМесяца.Параметры.МесяцПериода = Формат(ВыборкаДатаМесяц.ДатаМесяц, "ДФ=MMMM");
						КонецЕсли;
						
						ВыборкаДатаДень = ВыборкаДатаМесяц.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "ДатаДень");
											
						Пока ВыборкаДатаДень.Следующий() Цикл
							
							Если ЗначениеЗаполнено(ВыборкаДатаДень.ДатаДень) Тогда
								ОбластьОстатокНаКонецДня.Параметры.ДеньПериода = Формат(ВыборкаДатаДень.ДатаДень, "ДФ=dd.MM.yyyy");
							КонецЕсли;
							
							ОбластьОстатокНаКонецДня.Параметры.Заполнить(ВыборкаДатаДень);
							
							ВыборкаДетальныеЗаписи = ВыборкаДатаДень.Выбрать();
							
							ПервыйОбход = Истина;
							Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
								Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.РегистраторНДС) ИЛИ ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.РегистраторНДСКВозмещению) Тогда
									
										ОбластьДетальнаяЗапись.Параметры.Заполнить(ВыборкаДетальныеЗаписи); 
										
										РегистраторНДССсылка = ВыборкаДетальныеЗаписи.РегистраторНДС;
										РегистраторНДСКВозмещениюСсылка = ВыборкаДетальныеЗаписи.РегистраторНДСКВозмещению;
										
										РегистраторНДСПредставление = ВыборкаДетальныеЗаписи.РегистраторНДСПредставление;
										РегистраторНДСКВозмещениюПредставление = ВыборкаДетальныеЗаписи.РегистраторНДСКВозмещениюПредставление;
										
										РегистраторНДСМассив = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(РегистраторНДСПредставление, " от ", Истина); 
										РегистраторНДСКВозмещениюМассив = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(РегистраторНДСКВозмещениюПредставление, " от ", Истина);
											
										ОбластьДетальнаяЗапись.Параметры.РегистраторНДСПредставление = ?(РегистраторНДСМассив.Количество(),РегистраторНДСМассив[0],""); 
										ОбластьДетальнаяЗапись.Параметры.РегистраторНДСКВозмещениюПредставление = ?(РегистраторНДСКВозмещениюМассив.Количество(),РегистраторНДСКВозмещениюМассив[0], "");
																				
										ОбластьДетальнаяЗапись.Параметры.РегистраторНДС = РегистраторНДССсылка;
										ОбластьДетальнаяЗапись.Параметры.РегистраторНДСКВозмещению = РегистраторНДСКВозмещениюСсылка; 
																			
										ВывестиДанныеВОтчет(ДокументРезультат, ОбластьДетальнаяЗапись, ПараметрыОтчета);  		
								КонецЕсли;								
																	
								Если ПервыйОбход Тогда
									ИтогоМесяцОбщаяСумма        	    =  ВыборкаДетальныеЗаписи.ОбщаяСуммаИтогМесяц;
									ИтогоМесяцОборотСуммаНДС   			=  ВыборкаДетальныеЗаписи.ОборотСуммаНДСИтогМесяц;
									ИтогоМесяцСуммаНДС          		=  ВыборкаДетальныеЗаписи.СуммаНДСИтогМесяц;
									ИтогоМесяцОборотСуммаБезНДС 		= ВыборкаДетальныеЗаписи.СуммаБезНДСИтогМесяц;
									ИтогоМесяцОборотСуммаНДСКВозмещению = ВыборкаДетальныеЗаписи.СуммаНДСКВозмещениюИтогМесяц;											
								КонецЕсли;
								
									ЗаполнятьМесяц = ?((КонецМесяца(ВыборкаДетальныеЗаписи.РегистраторДата) <= КонецДня(ПараметрыОтчета.КонецПериода)), Истина, Ложь);
									ЗаполнятьКвартал = ?((КонецКвартала(ВыборкаДетальныеЗаписи.РегистраторДата)<= КонецДня(ПараметрыОтчета.КонецПериода)), Истина, Ложь);
									ЗаполнятьПолугодие = ?((ВыборкаДатаПолугодие.ДатаПолугодие <= КонецДня(ПараметрыОтчета.КонецПериода)), Истина, Ложь); 
									ЗаполнятьГод = ?((КонецГода(ПараметрыОтчета.КонецПериода) = КонецДня(ПараметрыОтчета.КонецПериода)), Истина, Ложь);
									
								Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.ОборотСуммаНДС) ИЛИ ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.СуммаНДС)
									ИЛИ ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.ОбщаяСумма) ИЛИ ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.СуммаБезНДС)
									ИЛИ ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.СуммаНДСКВозмещению) Тогда  								
									ЗаполнятьДень = Истина;
								Иначе
									ЗаполнятьДень = Ложь;
								КонецЕсли;																								
								ПервыйОбход = Ложь;
							КонецЦикла;
							
							Если ЗаполнятьДень Тогда
								ВывестиДанныеВОтчет(ДокументРезультат, ОбластьОстатокНаКонецДня, ПараметрыОтчета);	
							КонецЕсли;  																	
														
						КонецЦикла;
						
						Если ЗаполнятьМесяц Тогда  		
														
							ИтогоМесяцОбщаяСумма 				= ИтогоМесяцОбщаяСумма + ВыборкаДатаМесяц.ОбщаяСумма ;
							ИтогоМесяцОборотСуммаНДС 			= ИтогоМесяцОборотСуммаНДС + ВыборкаДатаМесяц.ОборотСуммаНДС;
							ИтогоМесяцСуммаНДС    				= ИтогоМесяцСуммаНДС + ВыборкаДатаМесяц.СуммаНДС;
							ИтогоМесяцОборотСуммаБезНДС 		= ИтогоМесяцОборотСуммаБезНДС + ВыборкаДатаМесяц.СуммаБезНДС;
							ИтогоМесяцОборотСуммаНДСКВозмещению = ИтогоМесяцОборотСуммаНДСКВозмещению + ВыборкаДатаМесяц.СуммаНДСКВозмещению;
							       											     						
							ОбластьОстатокНаКонецМесяца.Параметры.ОбщаяСумма		  = ИтогоМесяцОбщаяСумма;
							ОбластьОстатокНаКонецМесяца.Параметры.ОборотСуммаНДС 	  = ИтогоМесяцОборотСуммаНДС;
							ОбластьОстатокНаКонецМесяца.Параметры.СуммаНДС			  = ИтогоМесяцСуммаНДС;
							ОбластьОстатокНаКонецМесяца.Параметры.СуммаБезНДС 		  = ИтогоМесяцОборотСуммаБезНДС;
							ОбластьОстатокНаКонецМесяца.Параметры.СуммаНДСКВозмещению = ИтогоМесяцОборотСуммаНДСКВозмещению;
							
							Если ПараметрыОтчета.ВыводитьИтогиСНарастающимИтогом Тогда     
								Если НачалоМесяца(ПараметрыОтчета.НачалоПериода) <= НачалоМесяца(ВыборкаДатаМесяц.ДатаМесяц) Тогда 
									ВывестиДанныеВОтчет(ДокументРезультат, ОбластьОстатокНаКонецМесяца, ПараметрыОтчета);    
								КонецЕсли;
							Иначе
								Если КонецДня(ПараметрыОтчета.КонецПериода) = КонецМесяца(ПараметрыОтчета.КонецПериода) И КонецМесяца(ВыборкаДатаМесяц.ДатаМесяц) = КонецМесяца(ПараметрыОтчета.КонецПериода) Тогда  
									ВывестиДанныеВОтчет(ДокументРезультат, ОбластьОстатокНаКонецМесяца, ПараметрыОтчета);
								КонецЕсли;
							КонецЕсли;
							
							//заполним итоги за квартал
							ИтогоКварталОбщаяСумма        		  = ИтогоКварталОбщаяСумма          + ИтогоМесяцОбщаяСумма;
							ИтогоКварталОборотСуммаНДС   		  = ИтогоКварталОборотСуммаНДС      + ИтогоМесяцОборотСуммаНДС;
							ИтогоКварталСуммаНДС          		  = ИтогоКварталСуммаНДС            + ИтогоМесяцСуммаНДС;
							ИтогоКварталСуммаБезНДС		          = ИтогоКварталСуммаБезНДС         + ИтогоМесяцОборотСуммаБезНДС;
							ИтогоКварталСуммаНДСКВозмещению       = ИтогоКварталСуммаНДСКВозмещению + ИтогоМесяцОборотСуммаНДСКВозмещению;
							
						КонецЕсли;
												
					КонецЦикла;
					
					Если ЗаполнятьКвартал Тогда  
						
						ОбластьОстатокНаКонецКвартала.Параметры.ОбщаяСумма	 	     = ИтогоКварталОбщаяСумма;
						ОбластьОстатокНаКонецКвартала.Параметры.ОборотСуммаНДС 	     = ИтогоКварталОборотСуммаНДС;
						ОбластьОстатокНаКонецКвартала.Параметры.СуммаНДС 		 	 = ИтогоКварталСуммаНДС;
						ОбластьОстатокНаКонецКвартала.Параметры.СуммаБезНДС 	 	 = ИтогоКварталСуммаБезНДС;
						ОбластьОстатокНаКонецКвартала.Параметры.СуммаНДСКВозмещению  = ИтогоКварталСуммаНДСКВозмещению;						
						
						Если ПараметрыОтчета.ВыводитьИтогиСНарастающимИтогом Тогда  
							Если НачалоКвартала(ПараметрыОтчета.НачалоПериода) <= НачалоКвартала(ВыборкаДатаКвартал.ДатаКвартал) Тогда
								ВывестиДанныеВОтчет(ДокументРезультат, ОбластьОстатокНаКонецКвартала, ПараметрыОтчета);
							КонецЕсли;
						Иначе
							Если КонецДня(ПараметрыОтчета.КонецПериода) = КонецКвартала(ПараметрыОтчета.КонецПериода) И КонецКвартала(ВыборкаДатаКвартал.ДатаКвартал) = КонецКвартала(ПараметрыОтчета.КонецПериода)  Тогда
								 ВывестиДанныеВОтчет(ДокументРезультат, ОбластьОстатокНаКонецКвартала, ПараметрыОтчета);
							КонецЕсли;
						КонецЕсли;
						
						//заполним итоги за полугодие
						ИтогоПолугодиеОбщаяСумма        	  = ИтогоПолугодиеОбщаяСумма          + ИтогоКварталОбщаяСумма;
						ИтогоПолугодиеОборотСуммаНДС   		  = ИтогоПолугодиеОборотСуммаНДС      + ИтогоКварталОборотСуммаНДС;
						ИтогоПолугодиеСуммаНДС          	  = ИтогоПолугодиеСуммаНДС            + ИтогоКварталСуммаНДС;
						ИтогоПолугодиеСуммаБезНДС		      = ИтогоПолугодиеСуммаБезНДС         + ИтогоКварталСуммаБезНДС;
						ИтогоПолугодиеСуммаНДСКВозмещению     = ИтогоПолугодиеСуммаНДСКВозмещению + ИтогоКварталСуммаНДСКВозмещению;

					КонецЕсли;
					
				КонецЦикла;
				
				Если ЗаполнятьПолугодие  Тогда      
					ОбластьОстатокНаКонецПолугодия.Параметры.ОбщаяСумма	 	     = ИтогоПолугодиеОбщаяСумма;
					ОбластьОстатокНаКонецПолугодия.Параметры.ОборотСуммаНДС 	 = ИтогоПолугодиеОборотСуммаНДС;
					ОбластьОстатокНаКонецПолугодия.Параметры.СуммаНДС 		 	 = ИтогоПолугодиеСуммаНДС;
					ОбластьОстатокНаКонецПолугодия.Параметры.СуммаБезНДС 	 	 = ИтогоПолугодиеСуммаБезНДС;
					ОбластьОстатокНаКонецПолугодия.Параметры.СуммаНДСКВозмещению = ИтогоПолугодиеСуммаНДСКВозмещению;
					
					Если ПараметрыОтчета.ВыводитьИтогиСНарастающимИтогом Тогда   
						Если ПолучитьНомерПолугодия(ПараметрыОтчета.НачалоПериода) <= ПолучитьНомерПолугодия(ВыборкаДатаПолугодие.ДатаПолугодие) Тогда 
							ВывестиДанныеВОтчет(ДокументРезультат, ОбластьОстатокНаКонецПолугодия, ПараметрыОтчета);   
						КонецЕсли;
					Иначе
						Если ВыборкаДатаПолугодие.ДатаПолугодие = КонецДня(ПараметрыОтчета.КонецПериода) Тогда
							ВывестиДанныеВОтчет(ДокументРезультат, ОбластьОстатокНаКонецПолугодия, ПараметрыОтчета);	
						КонецЕсли;
					КонецЕсли;
					
					//заполним итоги за полугодие
					ИтогоГодОбщаяСумма        	  = ИтогоГодОбщаяСумма          + ИтогоПолугодиеОбщаяСумма;
					ИтогоГодОборотСуммаНДС   	  = ИтогоГодОборотСуммаНДС      + ИтогоПолугодиеОборотСуммаНДС;
					ИтогоГодСуммаНДС          	  = ИтогоГодСуммаНДС            + ИтогоПолугодиеСуммаНДС;
					ИтогоГодСуммаБезНДС		      = ИтогоГодСуммаБезНДС         + ИтогоПолугодиеСуммаБезНДС;
					ИтогоГодСуммаНДСКВозмещению   = ИтогоГодСуммаНДСКВозмещению + ИтогоПолугодиеСуммаНДСКВозмещению;					
				КонецЕсли;
				
			КонецЦикла;
			
			Если ЗаполнятьГод Тогда  
				
				ОбластьОстатокНаКонецГода.Параметры.ОбщаяСумма	 	    = ИтогоГодОбщаяСумма;
				ОбластьОстатокНаКонецГода.Параметры.ОборотСуммаНДС 	    = ИтогоГодОборотСуммаНДС;
				ОбластьОстатокНаКонецГода.Параметры.СуммаНДС 		    = ИтогоГодСуммаНДС;
				ОбластьОстатокНаКонецГода.Параметры.СуммаБезНДС 	    = ИтогоГодСуммаБезНДС;
				ОбластьОстатокНаКонецГода.Параметры.СуммаНДСКВозмещению = ИтогоГодСуммаНДСКВозмещению;
				
				ВывестиДанныеВОтчет(ДокументРезультат, ОбластьОстатокНаКонецГода, ПараметрыОтчета);
					
			КонецЕсли;
			
		КонецЦикла;
		
	ВывестиДанныеВОтчет(ДокументРезультат, ОбластьПодвалОтчет, ПараметрыОтчета);	
		
	СформироватьТитульныйЛист("ТитульныйЛист", ПараметрыОтчета, СписокСформированныхЛистов, ДокументРезультат);
	
	СформироватьТитульныйЛист("ТитульныйЛист", ПараметрыОтчета, СписокСформированныхЛистов);
	
	СписокСформированныхЛистов.Добавить(ДокументРезультат, "Ведомость учета доходов");
	
КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

Функция ПолучитьНомерКвартала(Дата)  
    Возврат Цел((Месяц(Дата) - 1) / 3) + 1;
КонецФункции   

Функция ПолучитьНомерПолугодия(Дата)
	
	Если Дата >= НачалоГода(Дата) И Дата <= КонецДня(ДобавитьМесяц(НачалоГода(Дата), 6)-1) Тогда
		Возврат Число("1");
	ИначеЕсли Дата >= НачалоДня(ДобавитьМесяц(НачалоГода(Дата), 6)) И Дата <= КонецГода(Дата) Тогда
		Возврат Число("2");
	КонецЕсли;
	
КонецФункции



// Формирование обложки книги
Процедура СформироватьТитульныйЛист(НазваниеМакета, ПараметрыОтчета, СписокСформированныхЛистов, ДокументРезультат=Неопределено)
	
	// Печать обложки и титульного листа
	Т1			   		  = Новый ТабличныйДокумент;
	Т1.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	Макет1 		   		  = ПолучитьМакет(НазваниеМакета);
	ОбластьОбложка		  = Макет1.ПолучитьОбласть("Обложка");
	КонецПериода          = ПараметрыОтчета.КонецПериода;
	
	СведенияОбОрганизации = ОбщегоНазначенияБКВызовСервера.СведенияОЮрФизЛице(ПараметрыОтчета.Организация, КонецПериода); 
	ОтветственныеЛица = ОбщегоНазначенияБКВызовСервера.ОтветственныеЛицаОрганизаций(ПараметрыОтчета.Организация, КонецПериода);
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Организации.Ссылка КАК Ссылка,
		|	Организации.ОсновнойВидДеятельности КАК ОсновнойВидДеятельности,
		|	Организации.ИндивидуальныйПредприниматель КАК ИндивидуальныйПредприниматель,
		|	Организации.ИндивидуальныйПредприниматель.ИдентификационныйКодЛичности КАК ИндивидуальныйПредпринимательИдентификационныйКодЛичности
		|ИЗ
		|	Справочник.Организации КАК Организации
		|ГДЕ
		|	Организации.Ссылка = &Организация";
	
	Запрос.УстановитьПараметр("Организация", ПараметрыОтчета.Организация);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ИндивидуальныйПредприниматель = ВыборкаДетальныеЗаписи.ИндивидуальныйПредприниматель;
		ИдентификационныйКодЛичностиИП = ВыборкаДетальныеЗаписи.ИндивидуальныйПредпринимательИдентификационныйКодЛичности; 
		ВидДеятельности = ВыборкаДетальныеЗаписи.ОсновнойВидДеятельности;	
	КонецЦикла;
	  	
	ТекстРНН_БИН = "";
	
	ОбластьОбложка.Параметры.ИмяИП = ИндивидуальныйПредприниматель; 
	ОбластьОбложка.Параметры.РНН_БИН = ИдентификационныйКодЛичностиИП;
	ОбластьОбложка.Параметры.ВидДеятельности = ВидДеятельности;
	
	ОбластьОбложка.Параметры.Серия = ОбщегоНазначенияБКВызовСервера.ОписаниеОрганизации(СведенияОбОрганизации, "СерияСвидетельстваПоНДС,", Ложь, КонецДня(КонецПериода));
	ОбластьОбложка.Параметры.Номер = ОбщегоНазначенияБКВызовСервера.ОписаниеОрганизации(СведенияОбОрганизации, "НомерСвидетельстваПоНДС,", Ложь, КонецДня(КонецПериода));
	ОбластьОбложка.Параметры.ДатаВыдачи = Формат(Дата(ОбщегоНазначенияБКВызовСервера.ОписаниеОрганизации(СведенияОбОрганизации, "ДатаСвидетельстваПоНДС,", Ложь, КонецДня(КонецПериода))), "ДФ=dd.MM.yyyy");
	
	ДатаПостановкиНаУчетНДС =  ОбщегоНазначенияБКВызовСервера.ОписаниеОрганизации(СведенияОбОрганизации, "ДатаСвидетельстваПоНДС,", Ложь, КонецДня(КонецПериода));
	ОбластьОбложка.Параметры.ДатаПостановки = Формат(НачалоМесяца(Дата(ДатаПостановкиНаУчетНДС)), "ДФ=dd.MM.yyyy");
	
	ОбластьОбложка.Параметры.НачалоОкончаниеДеятельности = "" + Формат(ПараметрыОтчета.НачалоДеятельности, "ДФ=dd.MM.yyyy") + " - " + Формат(ПараметрыОтчета.КонецДеятельности, "ДФ=dd.MM.yyyy");
			
	Т1.Вывести(ОбластьОбложка);
		
	//Руководители = ОбщегоНазначенияБКВызовСервера.ОтветственныеЛицаОрганизаций(ПараметрыОтчета.Организация, КонецДня(КонецПериода));

	Т1.ОтображатьСетку	   = Ложь;
	Т1.ОтображатьЗаголовки = Ложь;
	
	Т1.ТолькоПросмотр = Истина;   
	
	Если ДокументРезультат <> Неопределено И ТипЗнч(ДокументРезультат) = Тип("ТабличныйДокумент") Тогда
		Т1.ВывестиГоризонтальныйРазделительСтраниц();
		Т1.Вывести(ДокументРезультат); 	
	КонецЕсли; 
		
	Если ДокументРезультат <> Неопределено И ТипЗнч(ДокументРезультат) = Тип("ТабличныйДокумент") Тогда
		СписокСформированныхЛистов.Добавить(Т1, "Все"); 
	ИначеЕсли НазваниеМакета = "ТитульныйЛист" Тогда
		СписокСформированныхЛистов.Добавить(Т1, "Титульный лист");
	КонецЕсли;

		
КонецПРоцедуры

// Выводит данные в табличный документ
// в соответствии с настройкой печати разделов книги налогового учёта.
Процедура ВывестиДанныеВОтчет(ДокументРезультат, Область, ПараметрыОтчета)
							
	ДокументРезультат.Вывести(Область);
	
КонецПроцедуры // ВывестиДанныеВОтчет()

#КонецЕсли
